package structure.queue;

/**
 * Очереди (Queue) в Java
 * В Java Queue — это структура данных, работающая по принципу FIFO (First In, First Out, первый пришел — первый ушел). Это значит, что элементы добавляются в конец очереди и извлекаются из начала.
 * <p>
 * Интерфейс Queue реализуют такие классы, как:
 * <p>
 * LinkedList — обычная очередь (FIFO).
 * PriorityQueue — очередь с приоритетами (элементы извлекаются по приоритету, а не по порядку добавления).
 * ArrayDeque — двухсторонняя очередь.
 */
public class QueueExample {
}
